 

#sequencing-ეს არის რაიმე ინსტრუქციის თანმიმდევრობა, რომელსაც კომპიუტერი მიყვება ნაბიჯ-ნაბიჯ
#მაგალითდ რაიმე ამოცანას როდესაც ვაკეთბთ უნდა მივყვეთ პირობას, თორემ შეიძლება პასუხი 
#არასწორად მივიღოთ.

#iteration-ეს არის მოქმედება, რომელიც სრულდება მანამდე, სანამ გარკვეული პირობა არ 
#შესრულდება
#მაგალითდ როდესაც ვრეგისტრირდებით  უნდა დავწეროთ ემაილი და პაროლი თუ რომელიმეს
#არასწორად დავწერთ უკან დაგვაბრუნებს.

#selection-ეს არის არჩევანი, რომელსაც პროგრამა აკეთბს რაიმე პირობის გამომდინარე
# მაგალითად როდესაც ვიქნებით აბიტურიენტები ჩვენ უნდა ავირჩიოთ რომელიმე პროფესია.

#flowchart-ნიშნავ ბლოკ სქემას, ეს არის გრაფიკული დიაგრამა, რომელიც პროცესს ან ალგორითმს
#ნაბიჯ-ნაბიჯ მიჰყვება, რომელიც სქემურად აჩვენებს ამ ყოველივეს.
#მაგალითად როდესაც ვიწყებთ საიტზე შესვლას, მაგრამ არასწორად დავწერთ რაიმეს შესვლის დროს,
#უკან დაგვაბრუნებს უკან ავტორიზაციაში, მაგრამ თუ სწორად მაშინ შეგვიშვებს და დაგვიწერს
#წვდომა დაშვებულია.